IDENTIFICATION  DIVISION.            
PROGRAM-ID. EAD731RV.                
ENVIRONMENT DIVISION.                
INPUT-OUTPUT SECTION.                
FILE-CONTROL.                        
     SELECT VSAMPAI ASSIGN TO VSAMPAI
        ORGANIZATION IS INDEXED      
        ACCESS MODE  IS DYNAMIC      
        RECORD KEY   IS ARQ-CHAVE    
        FILE STATUS  IS FS-ARQVSAM.  
DATA DIVISION.                       
FILE SECTION.                        
FD VSAMPAI.                          
01 REG-VSAMPAI.                      
   02 ARQ-CHAVE   PIC X(3).          
   02 ARQ-DADOS   PIC X(30).         
WORKING-STORAGE SECTION.             
77 FS-ARQVSAM     PIC 9(2).     
PROCEDURE DIVISION.                                           
0001-UNICA SECTION.                                           
     OPEN I-O VSAMPAI.                                        
       IF FS-ARQVSAM NOT EQUAL ZEROS                          
         DISPLAY 'ERRO NA ABERTUTA DO ARQUIVO VSAMPAI'        
         PERFORM 9999-SAIDA                                   
       END-IF.                                                
       ACCEPT ARQ-CHAVE FROM SYSIN.                           
         READ VSAMPAI.                                        
           IF FS-ARQVSAM NOT EQUAL ZEROS                      
             DISPLAY 'REGISTRO NAO ENCONTRADO ARQUIVO VSAMPAI'
           ELSE                                               
             ACCEPT ARQ-DADOS FROM SYSIN                      
               REWRITE REG-VSAMPAI                            
                 IF FS-ARQVSAM EQUAL 00                       
                   DISPLAY 'DADOS ALTERADOS ' REG-VSAMPAI     
                 END-IF                                       
           END-IF.                                            
9999-SAIDA SECTION.                   
    DISPLAY ' FINAL DE PROCESSAMENTO '
    STOP RUN.                         
