IDENTIFICATION  DIVISION.             
PROGRAM-ID. EAD731ST.                 
ENVIRONMENT DIVISION.                 
INPUT-OUTPUT SECTION.                 
FILE-CONTROL.                         
     SELECT VSAMPAI ASSIGN TO VSAMPAI 
        ORGANIZATION IS INDEXED       
        ACCESS MODE  IS DYNAMIC       
        RECORD KEY   IS ARQ-CHAVE     
        FILE STATUS  IS FS-ARQVSAM.   
DATA DIVISION.                        
FILE SECTION.                         
FD VSAMPAI.                           
01 REG-VSAMPAI.                       
   02 ARQ-CHAVE   PIC X(3).           
   02 ARQ-DADOS   PIC X(30).          
WORKING-STORAGE SECTION.              
77 FS-ARQVSAM     PIC 9(2).           
PROCEDURE DIVISION.                                   
0001-UNICA SECTION.                                   
     OPEN INPUT VSAMPAI.                              
       IF FS-ARQVSAM NOT EQUAL ZEROS                  
         DISPLAY 'ERRO NA ABERTUTA DO ARQUIVO VSAMPAI'
         PERFORM 9999-SAIDA                           
       END-IF.                                        
       ACCEPT ARQ-CHAVE FROM SYSIN.                   
         START VSAMPAI KEY EQUAL ARQ-CHAVE            
           INVALID KEY DISPLAY 'CHAVE NAO ENCONTRADA' 
           NOT INVALID KEY PERFORM 0200-LER-REGISTROS.
           CLOSE VSAMPAI.                             
           IF FS-ARQVSAM NOT EQUAL ZEROS              
             DISPLAY 'ERRO NO FECHAMENTO ' FS-ARQVSAM 
           END-IF.                                    
           PERFORM 9999-SAIDA.                        
0200-LER-REGISTROS SECTION.                           
    READ VSAMPAI NEXT.                                
      PERFORM UNTIL FS-ARQVSAM EQUAL 10  
        DISPLAY 'REGISTRO - ' REG-VSAMPAI
        READ VSAMPAI NEXT                
      END-PERFORM.                       
9999-SAIDA SECTION.                      
    DISPLAY ' FINAL DE PROCESSAMENTO '   
    STOP RUN.                            
